n = int(input())
def to_word(n):
    ones_uniq = ["", "один","два","три","четыре","пять","шесть","семь","восемь","девять","десять",
            "одинадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать"]
    tens = ["","","двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто"]
    hundreds = ["", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"]


    if n == 0:
        return "0"
    if n == 1000:
        return "1000"
    elif n < 20:
        return ones_uniq[n]
    elif n < 100:
        return tens[n//10] + " " +ones_uniq[n%10]
    else:
        return hundreds[n//100]+ " " + tens[(n//10) % 10] + " " + ones_uniq[n % 10]

print(to_word(n))